ufvm/tutorials/incompressible/elbow/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mu                [1 -1 -1 0 0 0 0] 0.001003;
rho               [1 -3 0 0 0 0 0] 998.2;
k                 [1 1 -3 -1 0 0 0] 0.6;
Cp                [0 2 -2 -1 0 0 0] 4182;


// ************************************************************************* //
